# Rebar Bend Data Bend Radius Property

Source: https://www.revitapidocs.com/2026/79f57488-64c6-1630-02a0-b80ceedf510b.htm

---

| Rebar Bend Data Bend Radius Property |
| --- |

The radius of all fillets, except hook fillets, in the Rebar shape.
 The default value is 0\.0\.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double BendRadius { get; set; }
```

```
Public Property BendRadius As Double
	Get
	Set
```

```
public:
property double BendRadius {
	double get ();
	void set (double value);
}
```

```
member BendRadius : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for bendRadius is not finite |

Remarks Inner radius, not centerline See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace